app/controllers/index_controller.rb

SELECT `japs`.* FROM `japs` WHERE (Translation LIKE '% tone%'OR Translation LIKE'%feel%'OR Translation LIKE'%feeling%'OR Translation LIKE'%flavor%'OR Translation LIKE'%flavour%'OR Translation LIKE'%look%'OR Translation LIKE'%smell%'OR Translation LIKE'%disembodied spirit%'OR Translation LIKE'%emotional state%'OR Translation LIKE'%intent%'OR Translation LIKE'%purport%'OR Translation LIKE'%liveliness%'OR Translation LIKE'%life%'OR Translation LIKE'%sprightliness%'OR Translation LIKE'%heart%'OR Translation LIKE'%ambiance%'OR Translation LIKE'%ambience%'OR Translation LIKE'%animation%'OR Translation LIKE'%atmosphere%'OR Translation LIKE'%brio%'OR Translation LIKE'%character%'OR Translation LIKE'%disposition%'OR Translation LIKE'%emotion%'OR Translation LIKE'%fiber%'OR Translation LIKE'%fibre%'OR Translation LIKE'%import%'OR Translation LIKE'%invigoration%'OR Translation LIKE'%life principle%'OR Translation LIKE'%meaning%'OR Translation LIKE'%significance%'OR Translation LIKE'%signification%'OR Translation LIKE'%spiritedness%'OR Translation LIKE'%spiritual being%'OR Translation LIKE'%supernatural being%'OR Translation LIKE'%temperament%'OR Translation LIKE'%vital principle%'OR Translation LIKE'%vivification%'OR Translation LIKE'%spirit up%'OR Translation LIKE'%inspirit%'OR Translation LIKE'%animate%'OR Translation LIKE'%enliven%'OR Translation LIKE'%invigorate%'OR Translation LIKE'%liven%'OR Translation LIKE'%liven up%'OR Translation LIKE'%spirit%' )
---
  def show
@results= Jap.search(params[:search])