app/controllers/reg_words_controller.rb

  def index
    @reg_words = RegWord.all
---
SELECT `reg_words`.* FROM `reg_words`

  def create
    @reg_word = RegWord.new(reg_word_params)

    respond_to do |format|
      if @reg_word.save
---
INSERT INTO `reg_words` (`words`, `created_at`, `updated_at`) VALUES ('what', '2016-10-06 05:15:17', '2016-10-06 05:15:17')

  def destroy
    @reg_word.destroy
---
DELETE FROM `reg_words` WHERE `reg_words`.`id` = 17

    def set_reg_word
      @reg_word = RegWord.find(params[:id])
---
SELECT  `reg_words`.* FROM `reg_words` WHERE `reg_words`.`id` = 17 LIMIT 1